EmbeddedSystemClass/Management-Power/stm32f4-discovery-keil-freertos-blink-master/stm32f4-discovery-keil-freertos-blink-master/STM32F4_Discovery/discoveryf4utils.h
/**
  *					ENHANCED VERSION
  *
  *					jnosky
  *
  ******************************************************************************
  * @file    stm32f4_discovery.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    19-September-2011
  * @brief   This file contains definitions for STM32F4-Discovery Kit's Leds and 
  *          push-button hardware resources.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************  
  */ 
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DISCOVERYF4UTILS_H
#define __DISCOVERYF4UTILS_H

#ifdef __cplusplus
 extern "C" {
#endif
                                              
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_conf.h"
#include "stm32f4xx.h"
#include "main.h"

/** @addtogroup Utilities
  * @{
  */
  
/** @addtogroup STM32F4_DISCOVERY
  * @{
  */
      
/** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL
  * @{
  */ 

/** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Types
  * @{
  */
typedef enum 
{
  LED_GREEN = 0,
  LED_BLUE = 1,
  LED_RED = 2,
  LED_ORANGE = 3
} Led_TypeDef;

typedef enum 
{  
  BUTTON_USER = 0,
} Button_TypeDef;

typedef enum 
{  
  BUTTON_MODE_GPIO = 0,
  BUTTON_MODE_EXTI = 1
} ButtonMode_TypeDef;     
/**
  * @}
  */ 

/** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Constants
  * @{
  */ 

/** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL_LED
  * @{
  */
#define LEDn                             4

#define LED_RED_PIN                         GPIO_Pin_14
#define LED_RED_GPIO_PORT                   GPIOD
#define LED_RED_GPIO_CLK                    RCC_AHB1Periph_GPIOD
  
#define LED_GREEN_PIN                       GPIO_Pin_12
#define LED_GREEN_GPIO_PORT                 GPIOD
#define LED_GREEN_GPIO_CLK                  RCC_AHB1Periph_GPIOD
  
#define LED_BLUE_PIN                        GPIO_Pin_15
#define LED_BLUE_GPIO_PORT                  GPIOD
#define LED_BLUE_GPIO_CLK                   RCC_AHB1Periph_GPIOD
  
#define LED_ORANGE_PIN                      GPIO_Pin_13
#define LED_ORANGE_GPIO_PORT                GPIOD
#define LED_ORANGE_GPIO_CLK                 RCC_AHB1Periph_GPIOD
/**
  * @}
  */ 
  
/** @addtogroup STM32F4_DISCOVERY_LOW_LEVEL_BUTTON
  * @{
  */  
#define BUTTONn                          1  

/**
 * @brief Wakeup push-button
 */
#define USER_BUTTON_PIN                GPIO_Pin_0
#define USER_BUTTON_GPIO_PORT          GPIOA
#define USER_BUTTON_GPIO_CLK           RCC_AHB1Periph_GPIOA
#define USER_BUTTON_EXTI_LINE          EXTI_Line0
#define USER_BUTTON_EXTI_PORT_SOURCE   EXTI_PortSourceGPIOA
#define USER_BUTTON_EXTI_PIN_SOURCE    EXTI_PinSource0
#define USER_BUTTON_EXTI_IRQn          EXTI0_IRQn 
/**
  * @}
  */ 
  
/** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Macros
  * @{
  */  
/**
  * @}
  */ 


/** @defgroup STM32F4_DISCOVERY_LOW_LEVEL_Exported_Functions
  * @{
  */
void STM_EVAL_LEDInit(Led_TypeDef Led);
void STM_EVAL_LEDOn(Led_TypeDef Led);
void STM_EVAL_LEDOff(Led_TypeDef Led);
void STM_EVAL_LEDToggle(Led_TypeDef Led);
void STM_EVAL_PBInit(Button_TypeDef Button, ButtonMode_TypeDef Button_Mode);
void debug_init(void);
void debug_send_char(char chr);
void debug_printf(char *s);
uint32_t STM_EVAL_PBGetState(Button_TypeDef Button);
void pro_led(uint8_t u8_hours, uint8_t u8_minutes);
void quet_led(uint8_t ma);
void TIM_Init(void);
void adc_init(void);
void adc_config(void);
void vPCinit(void *pvParameters);
uint8_t vPCinitCreat(void);
void debug_irq(void);
/**
  * @}
  */
//=============================================================================
//=============================================================================
//				PORTS FROM OLDER EVAL TO DISCOVERY BOARD
//=============================================================================
//=============================================================================

//Comm port stuff
//todo: Enumerate the other com ports

#define COMn                             1

typedef enum
{
  COM1 = 0,
  COM2 = 1
} COM_TypeDef;

/**
 * @brief Definition for COM port1, connected to USART3
 */
#define EVAL_COM1                        USART3
#define EVAL_COM1_CLK                    RCC_APB1Periph_USART3
#define EVAL_COM1_TX_PIN                 GPIO_Pin_10
#define EVAL_COM1_TX_GPIO_PORT           GPIOC
#define EVAL_COM1_TX_GPIO_CLK            RCC_AHB1Periph_GPIOC
#define EVAL_COM1_TX_SOURCE              GPIO_PinSource10
#define EVAL_COM1_TX_AF                  GPIO_AF_USART3
#define EVAL_COM1_RX_PIN                 GPIO_Pin_11
#define EVAL_COM1_RX_GPIO_PORT           GPIOC
#define EVAL_COM1_RX_GPIO_CLK            RCC_AHB1Periph_GPIOC
#define EVAL_COM1_RX_SOURCE              GPIO_PinSource11
#define EVAL_COM1_RX_AF                  GPIO_AF_USART3
#define EVAL_COM1_IRQn                   USART3_IRQn

//Protos
void STM_EVAL_COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct);

//void STM_EVAL_COMInit(COM_TypeDef COM);




#define DEBUG_UART6                         USART6
#define DEBUG_UART6_PORT                    GPIOC
#define DEBUG_UART6_AF                      GPIO_AF_USART6
#define DEBUG_UART6_CLK                     RCC_APB2Periph_USART6
#define DEBUG_UART6_TX_PIN                  GPIO_Pin_6
#define DEBUG_UART6_TX_GPIO_PORT            GPIOC
#define DEBUG_UART6_TX_GPIO_CLK             RCC_AHB1Periph_GPIOC
#define DEBUG_UART6_TX_SOURCE               GPIO_PinSource6
#define DEBUG_UART6_TX_AF                   GPIO_AF_USART6
#define DEBUG_UART6_RX_PIN                  GPIO_Pin_7
#define DEBUG_UART6_RX_GPIO_PORT            GPIOC
#define DEBUG_UART6_RX_GPIO_CLK             RCC_AHB1Periph_GPIOC
#define DEBUG_UART6_RX_SOURCE               GPIO_PinSource7
#define DEBUG_UART6_RX_AF                   GPIO_AF_USART6
#define DEBUG_UART6_IRQn                    USART6_IRQn




#ifdef __cplusplus
}
#endif

#endif /* __DISCOVERYF4UTILS_H */
/**
  * @}
  */ 

/**
  * @}
  */ 

/**
  * @}
  */

 

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
